"# Examples\n\nThis directory contains a series of self-contained examples to help you get started or show how a specific feature can be utilized. The examples also serve the purpose of being part of the testing workflow to ensure they always work!\n\nWe love contributions and new examples that does not already exist, you can follow [this guide to contribute one](https://github.com/asyncapi/modelina/tree/master/examples/../docs/contributing.md#adding-examples)!\n\n---\n\n## Groups of Examples\n\n\n\n\n\n- [Input examples](#input-examples)\n- [General examples](#general-examples)\n- [Simple generator examples](#simple-generator-examples)\n- [Integrations](#integrations)\n- [Python](#python)\n- [JavaScript](#javascript)\n- [Java](#java)\n- [C#](#c%23)\n- [TypeScript](#typescript)\n- [Kotlin](#kotlin)\n- [Other examples](#other-examples)\n\n\n\n---\n\n## Input examples\nThese examples show a specific input and how they can be used:\n- [asyncapi-from-object](?selectedExample=asyncapi-from-object) - A basic example where an AsyncAPI JS object is used to generate models.\n- [asyncapi-from-parser](?selectedExample=asyncapi-from-parser) - A basic example where an AsyncAPI JS object from the [parser-js](https://github.com/asyncapi/parser-js) is used to generate models.\n- [asyncapi-from-v1-parser](?selectedExample=asyncapi-from-v1-parser) - A basic example where an AsyncAPI JS object from the old v1 [parser-js](https://github.com/asyncapi/parser-js) is used to generate models.\n- [json-schema-draft7-from-object](?selectedExample=json-schema-draft7-from-object) - A basic example where a JSON Schema draft 7 JS object is used to generate models.\n- [json-schema-draft6-from-object](?selectedExample=json-schema-draft6-from-object) - A basic example where a JSON Schema draft 6 JS object is used to generate models.\n- [json-schema-draft4-from-object](?selectedExample=json-schema-draft4-from-object) - A basic example where a JSON Schema draft 4 JS object is used to generate models.\n- [swagger2.0-from-object](?selectedExample=swagger2.0-from-object) - A basic example where a Swagger 2.0 JS object is used to generate models.\n- [meta-model](?selectedExample=meta-model) - A basic example how to provide a meta model for the generator\n\n## General examples\nThese are examples that can be applied in all scenarios.\n- [include-custom-function](?selectedExample=include-custom-function) - A basic example where a custom function is included.\n- [overwrite-naming-formatting](?selectedExample=overwrite-naming-formatting) - A basic example how to overwrite default naming format constraint in this case, overwriting returning a constant case format.\n- [overwrite-default-constraint](?selectedExample=overwrite-default-constraint) -  A basic example how to overwrite the entire constraint logic and not just a single single part of the default behavior, in this case overwriting the model naming constraint.\n- [custom-logging](?selectedExample=custom-logging) - A basic example where a custom logger is used.\n- [generate-to-files](?selectedExample=generate-to-files) - A basic example that shows how you can generate the models directly to files.\n- [indentation-type-and-size](?selectedExample=indentation-type-and-size) - This example shows how to change the indentation type and size of the generated model.\n- [change-type-mapping](?selectedExample=change-type-mapping) - A basic example showing how to change the type of a model in some context.\n- [change-type-mapping-with-dependency](?selectedExample=change-type-mapping-with-dependency) - A basic example showing how to use the dependency manager to inject your own custom type with a dependency instead of the default type.\n\n\n## Simple generator examples\nThese are all the basic generator examples that shows a bare minimal example of a generator:\n- [generate-typescript-models](?selectedExample=generate-typescript-models) - A basic example to generate TypeScript data models\n- [generate-csharp-models](?selectedExample=generate-csharp-models) - A basic example to generate C# data models\n- [generate-python-models](?selectedExample=generate-python-models) - A basic example showing how to generate Python models.\n- [rust-generate-crate](?selectedExample=rust-generate-crate) - A basic example showing how to generate a Rust package.\n- [generate-java-models](?selectedExample=generate-java-models) - A basic example to generate Java data models.\n- [generate-go-models](?selectedExample=generate-go-models) - A basic example to generate Go data models\n- [generate-javascript-models](?selectedExample=generate-javascript-models) - A basic example to generate JavaScript data models\n- [generate-kotlin-models](?selectedExample=generate-kotlin-models) - A basic example to generate Kotlin data models\n- [generate-cplusplus-models](?selectedExample=generate-cplusplus-models) - A basic example to generate C++ data models\n\n## Integrations\nThese are examples of how you can integrate Modelina into a specific scenario:\n- [integrate with React](?selectedExample=integrate-with-react) - A basic example that shows how you can integrate Modelina with React.\n\n## Python\nThese are all specific examples only relevant to the Python generator:\n- [generate-python-pydantic-models](?selectedExample=generate-python-pydantic-models) - An example showing how to generate Python pydantic models.\n- [python-generate-json-serializer-and-deseriazlier](?selectedExample=python-generate-json-serializer-and-deserializer) - An example that shows how to generate the models with JSON serializer and deserializer.\n\n## JavaScript\nThese are all specific examples only relevant to the JavaScript generator:\n- [javascript-use-esm](?selectedExample=javascript-use-esm) - A basic example that generate the models to use ESM module system.\n- [javascript-use-cjs](?selectedExample=javascript-use-cjs) - A basic example that generate the models to use CJS module system.\n- [javascript-generate-marshalling](?selectedExample=javascript-generate-marshalling) - A basic example of how to use the un/marshalling functionality of the javascript class.\n- [javascript-generate-example](?selectedExample=javascript-generate-example) - A basic example of how to use Modelina and output a JavaScript class with an example function.\n\n## Java\nThese are all specific examples only relevant to the Java generator:\n- [java-generate-tostring](?selectedExample=java-generate-tostring) - A basic example that shows how to generate models that overwrite the `toString` method\n- [java-change-collection-type](?selectedExample=java-change-collection-type) - An example to render collections as List in Java.\n- [java-generate-hashcode](?selectedExample=java-generate-hashcode) - A basic example that shows how to generate models that overwrite the `hashCode` method\n- [java-from-typescript-type](?selectedExample=java-from-typescript-type) - A basic example that shows how to generate a Java model from a TypeScript type input file.\n- [java-generate-marshalling](?selectedExample=java-generate-marshalling) - A basic example of how to use the un/marshalling functionality of the java class.\n- [java-from-typescript-type-with-options](?selectedExample=java-from-typescript-type-with-options) - A basic example that shows how to generate a Java model from a TypeScript type input file along with user provided options.\n- [java-generate-equals](?selectedExample=java-generate-equals) - A basic example that shows how to generate models that overwrite the `equal` method\n- [java-generate-javax-constraint-annotation](?selectedExample=java-generate-javax-constraint-annotation) - A basic example that shows how Java data models having `javax.validation.constraints` annotations can be generated.\n- [java-generate-javadoc](?selectedExample=java-generate-javadoc) - A basic example of how to generate Java models including JavaDocs.\n\n## C#\nThese are all specific examples only relevant to the C# generator:\n- [csharp-generate-equals-and-hashcode](?selectedExample=csharp-generate-equals-and-hashcode) - A basic example on how to generate models that overwrite the `Equal` and `GetHashCode` methods\n- [csharp-generate-json-serializer](?selectedExample=csharp-generate-json-serializer) - A basic example on how to generate models that include function to serialize the data models to and from JSON with System.Text.Json.\n- [csharp-generate-newtonsoft-serializer](?selectedExample=csharp-generate-newtonsoft-serializer) - A basic example on how to generate models that include function to serialize the data models to and form JSON with Newtonsoft.\n- [csharp-overwrite-enum-naming](?selectedExample=csharp-overwrite-enum-naming) - A basic example on how to generate enum value names.\n- [csharp-use-inheritance](?selectedExample=csharp-use-inheritance) - A basic example that shows how to introduce inheritance to classes \n- [csharp-generate-records](?selectedExample=csharp-generate-records) - A basic example that shows how to change C# model type from class to record.\n\n## TypeScript\nThese are all specific examples only relevant to the TypeScript generator:\n- [typescript-interface](?selectedExample=typescript-interface) - A basic TypeScript generator that outputs interfaces.\n- [typescript-enum-type](?selectedExample=typescript-enum-type) - A basic example of how to use Modelina can output different types of enums in TypeScript.\n- [typescript-generate-example](?selectedExample=typescript-generate-example) - A basic example of how to use Modelina and output a TypeScript class with an example function.\n- [typescript-generate-marshalling](?selectedExample=typescript-generate-marshalling) - A basic example of how to use the un/marshalling functionality of the typescript class.\n- [typescript-generate-comments](?selectedExample=typescript-generate-comments) - A basic example of how to generate TypeScript interfaces with comments from description and example fields.\n- [typescript-use-esm](?selectedExample=typescript-use-esm) - A basic example that generate the models to use ESM module system.\n- [typescript-use-cjs](?selectedExample=typescript-use-cjs) - A basic example that generate the models to use CJS module system.\n- [typescript-generate-jsonbinpack](?selectedExample=typescript-generate-jsonbinpack) - A basic example showing how to generate models that include [jsonbinpack](https://github.com/sourcemeta/jsonbinpack) functionality.\n\n## Kotlin\nThese are all specific examples only relevant to the Kotlin generator:\n- [generate-kotlin-enums](?selectedExample=generate-kotlin-enums)\n- [kotlin-generate-kdoc](?selectedExample=kotlin-generate-kdoc)\n- [kotlin-generate-javax-constraint-annotations](?selectedExample=kotlin-generate-javax-constraint-annotation)\n- [kotlin-change-collection-type](?selectedExample=kotlin-change-collection-type)\n\n## Other examples\nMiscelanious examples that do not fit into the otherwise grouping.\n- [TEMPLATE](https://github.com/asyncapi/modelina/tree/master/examples/TEMPLATE) - A basic template used to create new examples.\n"